lib/stripe_model_callbacks/fixtures/stripe_events/customer/customer.subscription.updated.json

{
  "created": 1326853478,
  "livemode": false,
  "id": "evt_00000000000000",
  "type": "customer.subscription.updated",
  "object": "event",
  "request": null,
  "pending_webhooks": 1,
  "api_version": "2018-01-23",
  "data": {
    "object": {
      "id": "sub_CGPu5KqP1TORKF",
      "object": "subscription",
      "application_fee_percent": null,
      "billing": "charge_automatically",
      "cancel_at_period_end": false,
      "canceled_at": null,
      "created": 1517772172,
      "current_period_end": 1520191372,
      "current_period_start": 1517772172,
      "customer": "cus_00000000000000",
      "days_until_due": null,
      "discount": null,
      "ended_at": null,
      "items": {
        "object": "list",
        "data": [
          {
            "id": "si_CGPuxYgJ7bx2UW",
            "object": "subscription_item",
            "created": 1517772173,
            "metadata": {
            },
            "plan": {
              "id": "silver-express-898",
              "object": "plan",
              "amount": 999,
              "created": 1506381458,
              "currency": "usd",
              "interval": "month",
              "interval_count": 1,
              "livemode": false,
              "metadata": {
              },
              "name": "Silver Express",
              "statement_descriptor": null,
              "trial_period_days": null
            },
            "quantity": 1,
            "subscription": "sub_CGPu5KqP1TORKF"
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/subscription_items?subscription=sub_CGPu5KqP1TORKF"
      },
      "livemode": false,
      "metadata": {
      },
      "plan": {
        "id": "silver-express-898",
        "object": "plan",
        "amount": 999,
        "created": 1506381458,
        "currency": "usd",
        "interval": "month",
        "interval_count": 1,
        "livemode": false,
        "metadata": {
        },
        "name": "Silver Express",
        "statement_descriptor": null,
        "trial_period_days": null
      },
      "quantity": 1,
      "start": 1517772172,
      "status": "active",
      "tax_percent": null,
      "trial_end": null,
      "trial_start": null
    },
    "previous_attributes": {
      "plan": {
        "id": "OLD_PLAN_ID",
        "object": "plan",
        "amount": 2000,
        "created": 1517772172,
        "currency": "usd",
        "interval": "month",
        "interval_count": 1,
        "livemode": false,
        "metadata": {
        },
        "name": "Old plan",
        "statement_descriptor": null,
        "trial_period_days": null
      }
    }
  }
}
